### **Function Application and Mapping**

In [1]:
import numpy as np
import pandas as pd

In [2]:
def f1(x):
    return x.max() - x.min()

In [3]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
    columns=list("bde"),
    index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -1.487418  0.782458 -1.698324
Ohio   -1.125316 -0.225348  0.461676
Texas   0.074051  0.236882 -1.437122
Oregon -1.978598 -0.786669  1.283645

In [4]:
np.abs(frame)

               b         d         e
Utah    1.487418  0.782458  1.698324
Ohio    1.125316  0.225348  0.461676
Texas   0.074051  0.236882  1.437122
Oregon  1.978598  0.786669  1.283645

In [5]:
frame.apply(f1)

b    2.052650
d    1.569127
e    2.981970
dtype: float64

In [6]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

In [7]:
frame.apply(f2)

            b         d         e
min -1.978598 -0.786669 -1.698324
max  0.074051  0.782458  1.283645

In [10]:
df = pd.DataFrame(np.random.standard_normal((4,4)),
                  columns=['A','B','C','D'],
                  index=list('shiraz,tehran,kerman,mashahd'.split(',')))
def f3(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])
df.apply(f3)

            A         B         C         D
min  0.500973  0.230206 -0.835982  0.840014
max  1.063094  1.474214  0.070484  2.173071

In [13]:
def my_format(x):
    return f"{x:.2f}"
df.map(my_format)

            A     B      C     D
shiraz   0.87  0.46  -0.45  1.43
tehran   0.50  0.63   0.07  0.84
kerman   1.06  0.23  -0.27  2.17
mashahd  0.51  1.47  -0.84  0.93

### **Sorting**

In [14]:
df.sort_index()

                A         B         C         D
kerman   1.063094  0.230206 -0.268282  2.173071
mashahd  0.505675  1.474214 -0.835982  0.929837
shiraz   0.874059  0.457735 -0.447364  1.425554
tehran   0.500973  0.627424  0.070484  0.840014

In [16]:
df.sort_values(by='A')

                A         B         C         D
tehran   0.500973  0.627424  0.070484  0.840014
mashahd  0.505675  1.474214 -0.835982  0.929837
shiraz   0.874059  0.457735 -0.447364  1.425554
kerman   1.063094  0.230206 -0.268282  2.173071